In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
import os
#os.chdir()
iris_data = pd.read_csv("iris.csv")
iris_data.head()

   Sepal Length  Sepal Width  Petal Length  Petal Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
iris_data['dummy'] = 1
iris_data.to_csv("iris_extended.csv")

In [5]:
iris_extended = pd.read_csv("iris_extended.csv")

In [9]:
#scifi_library
import pymysql.connector
cnx = mysql.connector.connect(user='root',password='',
                             host='localhost',
                             database='scifi_library')
cursor = cnx.cursor()
cursor.execute("select * from books")
df = DataFrame(cursor.fetchall())
df

ImportError: No module named connector

In [10]:
ir = pd.read_csv("https://dataminingproject.googlecode.com/svn-history/r44/DataMiningApp/datasets/Iris/iris.csv")
ir.head()

   Sepal Length  Sepal Width  Petal Length  Petal Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [11]:
empdf

NameError: name 'empdf' is not defined

In [12]:
emp_df

NameError: name 'emp_df' is not defined

In [17]:
emp_dict = {'id':[1, 2, 3, 4], 'isManager':['False','True','False','True'],
            'name':['Mark','Ian','Sam','Rich'], 'deptId':[1,1,2,2]}
empDf = DataFrame(emp_dict)
empDf

   deptId  id isManager  name
0       1   1     False  Mark
1       1   2      True   Ian
2       2   3     False   Sam
3       2   4      True  Rich

In [18]:
deptDict = { 'id' : [1, 2], 'name':['Sales', 'Engineering']}
deptDf = DataFrame(deptDict)
deptDf

   id         name
0   1        Sales
1   2  Engineering

In [19]:
pd.merge(empDf, deptDf, left_on='deptId', right_on='id')

   deptId  id_x isManager name_x  id_y       name_y
0       1     1     False   Mark     1        Sales
1       1     2      True    Ian     1        Sales
2       2     3     False    Sam     2  Engineering
3       2     4      True   Rich     2  Engineering

In [23]:
person_dict = {'name':['Sam', 'Mike', 'Rock', 'Alejandro', 'Carlos', 'william'],
               'salary':[20, 30, 20, 40, 10, 100]}
people_salaries = DataFrame(person_dict)
people_salaries

        name  salary
0        Sam      20
1       Mike      30
2       Rock      20
3  Alejandro      40
4     Carlos      10
5    william     100

In [25]:
people_salaries['Salary_Range'] = pd.cut(people_salaries.salary, [1, 30, 60])

In [26]:
people_salaries

        name  salary Salary_Range
0        Sam      20      (1, 30]
1       Mike      30      (1, 30]
2       Rock      20      (1, 30]
3  Alejandro      40     (30, 60]
4     Carlos      10      (1, 30]
5    william     100          NaN

In [36]:
car_dict = {'Brand': ['Ford', 'Toyota', 'Ford', 'Toyota', 'Mustang'],
            'Model': ['GT90', 'Highlander', 'Indigo', 'Z6r', 'Gt500']}
cardf = DataFrame(car_dict)
cardf

     Brand       Model
0     Ford        GT90
1   Toyota  Highlander
2     Ford      Indigo
3   Toyota         Z6r
4  Mustang       Gt500

In [37]:
cardf = cardf.join(pd.get_dummies(cardf.Brand))
#cardf = cardf.join(pd.get_dummies(cardf.Brand))

In [38]:
cardf

     Brand       Model  Ford  Mustang  Toyota
0     Ford        GT90     1        0       0
1   Toyota  Highlander     0        0       1
2     Ford      Indigo     1        0       0
3   Toyota         Z6r     0        0       1
4  Mustang       Gt500     0        1       0